Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_usb_dpram.h
// EP4_OUT_CONTROL Configuration

#define USB_DPRAM_EP4_OUT_CONTROL_BUFFER_ADDRESS                            (0xFFFFu<<0)
#define USB_DPRAM_EP4_OUT_CONTROL_BUFFER_ADDRESS_0                          (0x1u<<0)
#define USB_DPRAM_EP4_OUT_CONTROL_INTERRUPT_ON_NAK                          (0x1u<<16)
#define USB_DPRAM_EP4_OUT_CONTROL_INTERRUPT_ON_STALL                        (0x1u<<17)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE                             (0x3u<<26)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_0                           (0x1u<<26)
#define USB_DPRAM_EP4_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                 (0x1u<<28)
#define USB_DPRAM_EP4_OUT_CONTROL_INTERRUPT_PER_BUFF                        (0x1u<<29)
#define USB_DPRAM_EP4_OUT_CONTROL_DOUBLE_BUFFERED                           (0x1u<<30)
#define USB_DPRAM_EP4_OUT_CONTROL_ENABLE                                    (0x1u<<31)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_CONTROL                     (0x0u<<26)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                 (0x1u<<26)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_BULK                        (0x2u<<26)
#define USB_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_INTERRUPT                   (0x3u<<26)

// EP5_IN_CONTROL Configuration

#define USB_DPRAM_EP5_IN_CONTROL_BUFFER_ADDRESS                             (0xFFFFu<<0)
#define USB_DPRAM_EP5_IN_CONTROL_BUFFER_ADDRESS_0                           (0x1u<<0)
#define USB_DPRAM_EP5_IN_CONTROL_INTERRUPT_ON_NAK                           (0x1u<<16)
#define USB_DPRAM_EP5_IN_CONTROL_INTERRUPT_ON_STALL                         (0x1u<<17)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE                              (0x3u<<26)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_0                            (0x1u<<26)
#define USB_DPRAM_EP5_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                  (0x1u<<28)
#define USB_DPRAM_EP5_IN_CONTROL_INTERRUPT_PER_BUFF                         (0x1u<<29)
#define USB_DPRAM_EP5_IN_CONTROL_DOUBLE_BUFFERED                            (0x1u<<30)
#define USB_DPRAM_EP5_IN_CONTROL_ENABLE                                     (0x1u<<31)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_CONTROL                      (0x0u<<26)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                  (0x1u<<26)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_BULK                         (0x2u<<26)
#define USB_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_INTERRUPT                    (0x3u<<26)

// EP5_OUT_CONTROL Configuration

#define USB_DPRAM_EP5_OUT_CONTROL_BUFFER_ADDRESS                            (0xFFFFu<<0)
#define USB_DPRAM_EP5_OUT_CONTROL_BUFFER_ADDRESS_0                          (0x1u<<0)
#define USB_DPRAM_EP5_OUT_CONTROL_INTERRUPT_ON_NAK                          (0x1u<<16)
#define USB_DPRAM_EP5_OUT_CONTROL_INTERRUPT_ON_STALL                        (0x1u<<17)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE                             (0x3u<<26)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_0                           (0x1u<<26)
#define USB_DPRAM_EP5_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                 (0x1u<<28)
#define USB_DPRAM_EP5_OUT_CONTROL_INTERRUPT_PER_BUFF                        (0x1u<<29)
#define USB_DPRAM_EP5_OUT_CONTROL_DOUBLE_BUFFERED                           (0x1u<<30)
#define USB_DPRAM_EP5_OUT_CONTROL_ENABLE                                    (0x1u<<31)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_CONTROL                     (0x0u<<26)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                 (0x1u<<26)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_BULK                        (0x2u<<26)
#define USB_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_INTERRUPT                   (0x3u<<26)

// EP6_IN_CONTROL Configuration

#define USB_DPRAM_EP6_IN_CONTROL_BUFFER_ADDRESS                             (0xFFFFu<<0)
#define USB_DPRAM_EP6_IN_CONTROL_BUFFER_ADDRESS_0                           (0x1u<<0)
#define USB_DPRAM_EP6_IN_CONTROL_INTERRUPT_ON_NAK                           (0x1u<<16)
#define USB_DPRAM_EP6_IN_CONTROL_INTERRUPT_ON_STALL                         (0x1u<<17)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE                              (0x3u<<26)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_0                            (0x1u<<26)
#define USB_DPRAM_EP6_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                  (0x1u<<28)
#define USB_DPRAM_EP6_IN_CONTROL_INTERRUPT_PER_BUFF                         (0x1u<<29)
#define USB_DPRAM_EP6_IN_CONTROL_DOUBLE_BUFFERED                            (0x1u<<30)
#define USB_DPRAM_EP6_IN_CONTROL_ENABLE                                     (0x1u<<31)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_CONTROL                      (0x0u<<26)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                  (0x1u<<26)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_BULK                         (0x2u<<26)
#define USB_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_INTERRUPT                    (0x3u<<26)

// EP6_OUT_CONTROL Configuration

#define USB_DPRAM_EP6_OUT_CONTROL_BUFFER_ADDRESS                            (0xFFFFu<<0)
#define USB_DPRAM_EP6_OUT_CONTROL_BUFFER_ADDRESS_0                          (0x1u<<0)
#define USB_DPRAM_EP6_OUT_CONTROL_INTERRUPT_ON_NAK                          (0x1u<<16)
#define USB_DPRAM_EP6_OUT_CONTROL_INTERRUPT_ON_STALL                        (0x1u<<17)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE                             (0x3u<<26)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_0                           (0x1u<<26)
#define USB_DPRAM_EP6_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                 (0x1u<<28)
#define USB_DPRAM_EP6_OUT_CONTROL_INTERRUPT_PER_BUFF                        (0x1u<<29)
#define USB_DPRAM_EP6_OUT_CONTROL_DOUBLE_BUFFERED                           (0x1u<<30)
#define USB_DPRAM_EP6_OUT_CONTROL_ENABLE                                    (0x1u<<31)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_CONTROL                     (0x0u<<26)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                 (0x1u<<26)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_BULK                        (0x2u<<26)
#define USB_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_INTERRUPT                   (0x3u<<26)

// EP7_IN_CONTROL Configuration

#define USB_DPRAM_EP7_IN_CONTROL_BUFFER_ADDRESS                             (0xFFFFu<<0)
#define USB_DPRAM_EP7_IN_CONTROL_BUFFER_ADDRESS_0                           (0x1u<<0)
#define USB_DPRAM_EP7_IN_CONTROL_INTERRUPT_ON_NAK                           (0x1u<<16)
#define USB_DPRAM_EP7_IN_CONTROL_INTERRUPT_ON_STALL                         (0x1u<<17)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE                              (0x3u<<26)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_0                            (0x1u<<26)
#define USB_DPRAM_EP7_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF                  (0x1u<<28)
#define USB_DPRAM_EP7_IN_CONTROL_INTERRUPT_PER_BUFF                         (0x1u<<29)
#define USB_DPRAM_EP7_IN_CONTROL_DOUBLE_BUFFERED                            (0x1u<<30)
#define USB_DPRAM_EP7_IN_CONTROL_ENABLE                                     (0x1u<<31)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_CONTROL                      (0x0u<<26)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_ISOCHRONOUS                  (0x1u<<26)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_BULK                         (0x2u<<26)
#define USB_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_INTERRUPT                    (0x3u<<26)

// EP7_OUT_CONTROL Configuration

