Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_usb_dpram.h
// EP15_OUT_BUFFER_CONTROL Configuration

#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LENGTH_0                          (0x3FFu<<0)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LENGTH_0_0                        (0x1u<<0)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_AVAILABLE_0                       (0x1u<<10)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_STALL                             (0x1u<<11)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_RESET                             (0x1u<<12)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_PID_0                             (0x1u<<13)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LAST_0                            (0x1u<<14)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_FULL_0                            (0x1u<<15)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LENGTH_1                          (0x3FFu<<16)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LENGTH_1_0                        (0x1u<<16)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_AVAILABLE_1                       (0x1u<<26)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET          (0x3u<<27)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_0        (0x1u<<27)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_PID_1                             (0x1u<<29)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_LAST_1                            (0x1u<<30)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_FULL_1                            (0x1u<<31)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128      (0x0u<<27)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256      (0x1u<<27)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512      (0x2u<<27)
#define USB_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024     (0x3u<<27)
